dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
mini_nrf52840.name=AliExpress Mini nRF52840
mini_nrf52840.upload.tool=niusdfu
mini_nrf52840.upload.tool.default=niusdfu
mini_nrf52840.upload.use_1200bps_touch=true
mini_nrf52840.upload.wait_for_upload_port=true
mini_nrf52840.upload.protocol=dfu
mini_nrf52840.upload.usb_vid=0x1915
mini_nrf52840.upload.usb_pid=0x5282
mini_nrf52840.upload.dfu_alt=0
mini_nrf52840.upload.bootloader_mode=nordic-dfu
mini_nrf52840.upload.uf2_family_id=
mini_nrf52840.upload.uf2_app_start=0x0
mini_nrf52840.upload.uf2_volume_label=
mini_nrf52840.upload.uf2_model=
mini_nrf52840.upload.uf2_board_id=
mini_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
mini_nrf52840.upload.maximum_size=1032192
mini_nrf52840.upload.maximum_data_size=262144
mini_nrf52840.build.mcu=cortex-m4
mini_nrf52840.build.f_cpu=64000000L
mini_nrf52840.build.board=NRF52_MINI_840
mini_nrf52840.build.core=arduino
mini_nrf52840.build.variant=mini_nrf52840
mini_nrf52840.build.ldscript=nrf52840.ld
mini_nrf52840.build.usb_product="Mini nRF52840"
mini_nrf52840.build.base_flags=-DARDUINO_NRF52_MINI -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=0
mini_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
mini_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
mini_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
mini_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
mini_nrf52840.build.bootloader_app_start=0x0
mini_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
mini_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
mini_nrf52840.build.debug_flags=
mini_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
mini_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
mini_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
mini_nrf52840.build.storage_reserved_bytes=16384
mini_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
mini_nrf52840.menu.usbcdc.enabled=Enabled
mini_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
mini_nrf52840.menu.usbcdc.disabled=Disabled
mini_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
mini_nrf52840.menu.flashprofile.qspi=Internal 1 MB + QSPI (capacity unverified)
mini_nrf52840.menu.flashprofile.qspi.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
mini_nrf52840.menu.flashprofile.internal1m=Internal flash 1 MB only (clone override)
mini_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
mini_nrf52840.menu.ramprofile.sram256=Internal SRAM 256 KB (fixed)
mini_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
mini_nrf52840.menu.uploadmode.usb=USB bootloader (recommended)
mini_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
mini_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
mini_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
mini_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=true
mini_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=true
mini_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
mini_nrf52840.menu.uploadmode.swd=CMSIS-DAP SWD
mini_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
mini_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
mini_nrf52840.menu.uploadmode.swd.upload.protocol=swd
mini_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
mini_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
mini_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
mini_nrf52840.menu.bootloader.auto=Auto-detect (default, recommended)
mini_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
mini_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
mini_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
mini_nrf52840.menu.bootloader.auto.upload.uf2_family_id=
mini_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x0
mini_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
mini_nrf52840.menu.bootloader.auto.upload.uf2_model=
mini_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
mini_nrf52840.menu.bootloader.auto.upload.maximum_size=1032192
mini_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
mini_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x0
mini_nrf52840.menu.bootloader.nordicdfu=Nordic USB DFU (0x1915:0x5282)
mini_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
mini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
mini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
mini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
mini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
mini_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
mini_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=1032192
mini_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
mini_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
mini_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2
mini_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
mini_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
mini_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
mini_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
mini_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
mini_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
mini_nrf52840.menu.bootloader.nicenano.upload.maximum_size=876544
mini_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
mini_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
mini_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2
mini_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
mini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
mini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
mini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=
mini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=
mini_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=
mini_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=872448
mini_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
mini_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
mini_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary UF2
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
mini_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
mini_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
mini_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
mini_nrf52840.menu.buildprofile.release=Release (-Os)
mini_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
mini_nrf52840.menu.buildprofile.release.build.debug_flags=
mini_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
mini_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
mini_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
mini_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
mini_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
mini_nrf52840.menu.buildprofile.usbgdbstub=USB CDC GDB stub (-Og -g3)
mini_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
mini_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
mini_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
mini_nrf52840.menu.storage.log=Log-structured wear leveling
mini_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
mini_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
mini_nrf52840.menu.storage.legacy=Legacy single-page
mini_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
mini_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

